# თქვენი დავალება იქნება რომ ჩანაწერი ნახოთ ხელახლა, ამოიწეროთ კაჰუტის შეკითხვები და გაარჩიოთ


# 1) რას დაგვიბეჭდავს ეს კოდი ტერმინალში? print(type("Hello World!"))

# პასუხი: str-ს

# 2) რითი შევქმნათ პითონში კომენტარი?

# <--- პასუხი:

# 3) რისთვის ვიყენებთ range() ფუქნციას?

# პასუხი: შევქმნათ რიცხვების დიაპაზონი, გვქონდეს თნმიმდევრობა

# 4) სთრინგების კონკატინაციისთვის რომელ ოპერატორს ვიყენებთ?

# პასუხი: +-ს

# 5) ამ ოთხიდან რომელი არ არის სწორი მონაცემთა ტიპი (str, int, real, list)

# პასუხი: real-ი

# 6) რომელი ფუნქციის გამოყენებით შეგვიძლია მომხმარებელს შემოვატანინოთ ინფორმაცია?

# 7) რომელი სიტყვით (keyword) შეიქმნება ციკლი?

# პასუხი: for-ით

# 8) რომელი ფუნქციით გადავაქცევთ ტექტურ ინფორმაციას ათწილადად?

# პასუხი: float()-ით

# 9) რას დაგვიბეჭდავს ეს კოდი: print(2 > 3)?

# პასუხი: false-ს

# 10) რომელი კოდით შევქმნით უსასრულო ციკლს:

# პასუხი: while True-თი

# 11) რომელი დაგვიბეჭდავს ეს კოდი print('Hello' + 'World')

# პასუხი: Hello World-ს

# 12) რას დაგვიბეჭდავს ეს კოდი print(4 % 2)

# პასუხი: 0-ს

# 13) რომელია პითონის ფაილის სწორი დაბოლოება?

# პასუხი: .py

# 14) რას დაგვიბეჭდავს ეს კოდი print(10 == 10)

# პასუხი: True-ს

# 15) ამ 4-იდან რომელია სწორი ცვლადის სახელი? (2nd_var, var-name, var name, _var_name)

# პასუხი: _var_name 

# 16) რას დაგვიბეჭდავს ეს კოდი print('5'*8)

# პასუხი: 555-ს

# 17) რას დაგვიბეჭდავს ეს კოდი print('Hello'[-1]) ?

# პასუხი: o-ს

# 18) რას დაგვიბეჭდავს ეს კოდი print(list(range(2,10,2)))?

# პასუხი: [2,4,6,8]

# 19) რისთვის ვიყენებთ While ციკლს?

# პასუხი: კოდი მაშინ გაიშვას როდესაც ციკლის პირობა იქნება სწორი

# 20) ამ 4-დან, რომელი წინადადებაა სწორი while ციკლების შესახებ?

# პასუხი: while - ციკლი შესაძლოა უსასრულოდ გაგრძელდეს, თუ მისი სულ სწორი იქნება

# 21) boolean მონაცემთა ტიპის შესაძლო მნიშვნელობებია?

# პასუხი: True და False

# 22) ამ კოდიდან, რომლის მნიშვნელობა იქნება True? (5 > 10, 3==4, 5 > 7, 1 <= 1)

# პასუხი: 1 <= 1 

# 23) რომელი ოპერატორით ვამოწმებთ, ორივე boolean თუ არის True-ს ტოლი?

# პასუხი: and

# 24) როგორ დავბეჭდოთ 30? my_list = [10, 20, 30, 40]

# პასუხი: my_list[2]

# 25) ამ 4-დან, რომელია სწორი პითონის სია? (list = {1,2,3}, list = [1,2,3], list = <1,2,3>)

# პასუხი: list = [1,2,3]

# 26) რას ნიშნავს HTML?

# პასუხი: Hyper Text Markup Language

# 27) რა არის <head> თეგის დანიშნულება?

# პასუხი: საიტის ტექნიკური ინფორმაციის შენახვა

# 28) რომელი თეგით შეიქმნება Hyperlink-ი?

# პასუხი: <a>-თი

# 29) ყველაზე დიდი სათაური რომელი თეგით შეიქმნება?

# პასუხი: <h1>-ით

# 30) რომელი ატრიბუტი გამოიყენება სურათის ალტერნატიული ტექსტის დასაწერად?

# პასუხი: alt-ი

# 31) რაში გამოიყენება title თეგი?

# პასუხი: ვქმნით HTML-ის დოკუმენტის სათაურს

# 32) ხაზის გასაწყვეტად რომელ თეგს ვიყენებთ?

# პასუხი: <br>-ს

# 33) დაულაგებელის სიის შესაქმნელად რომელ ელემენტს ვიყენებთ?:

# პასუხი: <ul>-ს

# 34) როგორ შევქმნათ checkbox?

# პასუხი: <input type="checkbox">

# 35) რომელი ატრიბუტით შეგვიძლია css-ის გაწერა?

# პასუხი: style-ით

# 36) ტექსტის შესატანი ველი როგორ შევქმნათ?

# პასუხი: <input type = "text">

# 37) რომელი ატრიბუტით მივუთითებთ hyperlink-ის მისამართს? 

# პასუხი: href

# 38) რას წარმოადგენს em თეგი? 

# პასუხი: დახრილი ტექსტი 

# 39) რომელი ტეგით შეიქმნება form?

# პასუხი: <form> 

# 40) რომელი ატრიბუტით გახდება ელემენტი უნიკალური?

# პასუხი: id-ით

# 41) როგორ შევქმნათ დალაგებული სია? 

# პასუხი: <ol>-ით 

# 42) რომელი ტეგით შეიქმნება dropdown მენიუ?

# პასუხი: <select>-ით

# 43) რას წარმოადგენს nav თეგი? 

# პასუხი: სექცია სადაც გვაქვს ნავიგაციის ლინკები

# 44) რისთვის გამოიყენება main თეგი?

# პასუხი: საიტის მთავარი ნაწილის შექმნა

# 45) რომელია HTML-ის კომენტარი?:

# პასუხი: <!--This is comment-->

# 46) რომელი ატრიბუტით მივუტითებთ, რომ input აუცილებლად უნდა შეივსოს?

# პასუხი: required

# 47) სურათს რომელი თეგით ვამატებთ საიტზე? 

# პასუხი: <img>-თი

# 48) აუდიო ფაილების დასამატებლად რომელ თეგს ვიყენებთ?

# პასუხი: <audio>

# 49) ვიდეო ფაილების დასამატებლად რომელ თეგს ვიყენებთ?

# პასუხი: <video>

# 50) GOA თუ დანარჩენი პროგრამირების აკადემიები

# პასუხი: OF COURSE GOA BEST!