# Kahoot Questions

# 1) რას დაგვიბეჭდავს ეს კოდი ტერმინალში print(type("Hello, World!"))

# პასუხი: ეს კოდი დაგვიბეჭდავს class 'str'

# 2) როგორ შევქმნათ პითონში კომენტარი?

# პასუხი: # - ით

# 3) რისთვის ვიყენებთ range() ფუნქციას?

# პასუხი: რომ შევქმნათ დიაპაზონი, და გვქონდეს თანმიმდევრობა.

# 4) სტრინგების კონკატინაციისთვის რომელ ოპერატორს ვიყენებთ?

# პასუხი: + - სს

# 5) ამ ოთხიდან, რომელი არარის სწორი მონაცემთა ტიპი?: str, int, list, real

# პასუხი: real

# 6) რომელი ფუნქციის მეშვეობით შეგვიძლია მომხმარებელს შემოვატანინოთ ინფორმაცია?

# პასუხი: input()

#  7) რომელი სიტყვით (keyword) შეიქმნება ციკლი?

# პასუხი: for ციკლის მეშვეობით

# 8) რომელი ფუნქციით გადავაქცევთ ტექსტურ ინფორმაციას ათწილადად?

# პასუხი: float() - ის მეშვეობით.

# 9) რას დაგვიბეჭდავს ეს კოდი? 2 > 3?

#  პასუხი: ეს კოდი დაბეჭდავს false - სს

# 10) რომელი კოდით შევქმნით უსასრულო ციკლს?

# პასუხი: while True - ს მეშვეობით

# 11) რას დაგვიბეჭდავს ეს კოდი?: print('Hello' + 'World')?

# პასუხი: ეს კოდი დაგვიბეჭდავს Hello World - ს

# 12) რას დაგვიბეჭდავს ეს კოდი?: print(4 % 2)?

# პასუხი: ეს კოდი დაგვიბეჭდავს 0-ს

# 13) რომელია პითონის ფაილის სწორი დაბოლოება?

# პასუხი: პითონის ფაილის სწორი დაბოლოებაა .py

# 14) რას დაგვიბეჭდავს ეს კოდი?: print(10 == 10)?

# პასუხი: ეს კოდი დაგვიბეჭდავს True - ს

# 15) ამ 4 -იდან რომელია სწორი ცვლადის სახელი?: (_var_name, var name, var-name, 2nd_var)

# პასუხი: 2nd_var

# 16) რას დაგვიბეჭდავს ეს კოდი?: print('5' * 3)

# პასუხი: ეს კოდი დაგვიბეჭდავს 555 - ს

# 17) რას დაგვიბეჭდავს ეს კოდი? print(list(range(2, 10, 2)))

# პასუხი: ეს კოდი დაგვიბეჭდავს: 2,4,6,8 -ს

# 18) რისთვის ვიყენებთ While ციკლს?

# პასუხი: კოდი მაშინ გაეშვას როდესაც ციკლის პირობა იქნება სწორი

# 19) ამ ოთხიდან, რომელია სწორი წინადადება while ციკლების შესახებ?

# 1) while ციკლი შესაძლოა უსასრულოდ გაგრძელდეს, თუ მისი პირობა სულ სწორი იქნება,
# 2) while ციკლი მხოლოდ ერთხელ გაეშვება
# 3) while ციკლებს ვიყენებთ მხოლოდ სიებზე სამუშაოდ
# 4) while ციკლი მხოლოდ დანეჭდავს რიცხვებს

# პასუხი: სწორია while ციკლი შესაძლოა უსასრულოდ გაგრძელდეს, თუ მისი პირობა სულ სწორი იქნება,

# 20) boolean მონაცემთა ტიპის შესაძლო მნიშვნელობებია?

# პასუხი: True და False - ი

# 21) ამ ოთხი კოდიდან რომელი იქნება True?

# 1) 5 > 10
# 2) 3 == 4
# 3) 5 > 7
# 4) 1 <= 1

# პასუხი: სწორია 1 <= 1

# 22) რომელი ოპერატორით ვამოწმებთ, ორივე boolean თუ არის True - ს ტოლი?

# პასუხი: and - ით

# 23) როგორ დავბეჭდოთ 30? my_list = [10,20,30,40]

# პასუხი: my_list[2]

# 24) ამ 4-იდან, რომელია სწორი პითონის სია?

# 1) list = (1,2,3)
# 2) list = [1,2,3]
# 3) list = <1,2,3>
# 4) list = {1,2,3}

# პასუხი: სწორია list = [1,2,3]

# 25) რას ნიშნავს HTML?

# პასუხი: Hyper-Text Markup Language - ს

# 26) რა არის <head> ის დანიშნულება?

# პასუხი: საიტის ტექნიკური ინფორმაციის დანიშნულება

# 27) რომელი თეგით შეიქმნება hyperlink?

# პასუხი: <a> თეგით

# 28) ყველაზე დიდი სათაური რომელი თეგით შეიქმნება?

# პასუხი: <h1> - ით

# 29) რომელი ატრიბუტი გამოიყენება
