# Kahoot Questions

# 1) რას დაგვიბეჭდავს ეს კოდი ტერმინალში print(type("Hello, World!"))

# პასუხი: ეს კოდი დაგვიბეჭდავს class 'str'

# 2) როგორ შევქმნათ პითონში კომენტარი?

# პასუხი: # - ით

# 3) რისთვის ვიყენებთ range() ფუნქციას?

# პასუხი: რომ შევქმნათ დიაპაზონი, და გვქონდეს თანმიმდევრობა.

# 4) სტრინგების კონკატინაციისთვის რომელ ოპერატორს ვიყენებთ?

# პასუხი: + - სს

# 5) ამ ოთხიდან, რომელი არარის სწორი მონაცემთა ტიპი?: str, int, list, real

# პასუხი: real

# 6) რომელი ფუნქციის მეშვეობით შეგვიძლია მომხმარებელს შემოვატანინოთ ინფორმაცია?

# პასუხი: input()

#  7) რომელი სიტყვით (keyword) შეიქმნება ციკლი?

# პასუხი: for ციკლის მეშვეობით

# 8) რომელი ფუნქციით გადავაქცევთ ტექსტურ ინფორმაციას ათწილადად?

# პასუხი: float() - ის მეშვეობით.

# 9) რას დაგვიბეჭდავს ეს კოდი? 2 > 3?

#  პასუხი: ეს კოდი დაბეჭდავს false - სს

# 1) რომელი კოდით შევქმნით უსასრულო ციკლს?

# პასუხი: while True - ს მეშვეობით

# 1) რას დაგვიბეჭდავს ეს კოდი?: print('Hello' + 'World')?

# პასუხი: ეს კოდი დაგვიბეჭდავს Hello World - ს

# 1) რას დაგვიბეჭდავს ეს კოდი?: print(4 % 2)?

# პასუხი: ეს კოდი დაგვიბეჭდავს 0-ს

# 1) რომელია პითონის ფაილის სწორი დაბოლოება?

# პასუხი: პითონის ფაილის სწორი დაბოლოებაა .py

# 1) რას დაგვიბეჭდავს ეს კოდი?: print(10 == 10)?

# პასუხი: ეს კოდი დაგვიბეჭდავს True - ს

# 1) ამ 4 -იდან რომელია სწორი ცვლადის სახელი?: (_var_name, var name, var-name, 2nd_var)

# პასუხი: 2nd

# ) რას დაგვიბეჭდავს ეს კოდი?: print('5' * 3)

# პასუხი: ეს კოდი დაგვიბეჭდავს 555 - ს

# ) print(list(range(2, 10, 2)))

# 1) 

# პასუხი: 